docs/evidence/dev-backend-performance-2026-07-26/raw/authenticated-read-run-1-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/backend/load_tests/dev_backend_baseline.js
        output: json (/work/backend/load_tests/results/authenticated-read-run-1-points.json)

     scenarios: (100.00%) 1 scenario, 4 max VUs, 1m30s max duration (incl. graceful stop):
              * authenticated-read: 0.33 iterations/s for 1m0s (maxVUs: 2-4, gracefulStop: 30s)


Run                  [ 100% ] setup()
authenticated-read   [   0% ]

running (0m02.0s), 1/2 VUs, 0 complete and 0 interrupted iterations
authenticated-read   [   1% ] 1/2 VUs  0m00.8s/1m0s  0.33 iters/s

running (0m03.0s), 1/2 VUs, 0 complete and 0 interrupted iterations
authenticated-read   [   3% ] 1/2 VUs  0m01.8s/1m0s  0.33 iters/s

running (0m04.0s), 0/2 VUs, 1 complete and 0 interrupted iterations
authenticated-read   [   5% ] 0/2 VUs  0m02.8s/1m0s  0.33 iters/s

running (0m05.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
authenticated-read   [   6% ] 1/2 VUs  0m03.8s/1m0s  0.33 iters/s

running (0m06.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
authenticated-read   [   8% ] 1/2 VUs  0m04.8s/1m0s  0.33 iters/s

running (0m07.0s), 0/2 VUs, 2 complete and 0 interrupted iterations
authenticated-read   [  10% ] 0/2 VUs  0m05.8s/1m0s  0.33 iters/s

running (0m08.0s), 1/2 VUs, 2 complete and 0 interrupted iterations
authenticated-read   [  11% ] 1/2 VUs  0m06.8s/1m0s  0.33 iters/s

running (0m09.0s), 1/2 VUs, 2 complete and 0 interrupted iterations
authenticated-read   [  13% ] 1/2 VUs  0m07.8s/1m0s  0.33 iters/s

running (0m10.0s), 0/2 VUs, 3 complete and 0 interrupted iterations
authenticated-read   [  15% ] 0/2 VUs  0m08.8s/1m0s  0.33 iters/s

running (0m11.0s), 1/2 VUs, 3 complete and 0 interrupted iterations
authenticated-read   [  16% ] 1/2 VUs  0m09.8s/1m0s  0.33 iters/s

running (0m12.0s), 1/2 VUs, 3 complete and 0 interrupted iterations
authenticated-read   [  18% ] 1/2 VUs  0m10.8s/1m0s  0.33 iters/s

running (0m13.0s), 0/2 VUs, 4 complete and 0 interrupted iterations
authenticated-read   [  20% ] 0/2 VUs  0m11.8s/1m0s  0.33 iters/s

running (0m14.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
authenticated-read   [  21% ] 1/2 VUs  0m12.8s/1m0s  0.33 iters/s

running (0m15.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
authenticated-read   [  23% ] 1/2 VUs  0m13.8s/1m0s  0.33 iters/s

running (0m16.0s), 0/2 VUs, 5 complete and 0 interrupted iterations
authenticated-read   [  25% ] 0/2 VUs  0m14.8s/1m0s  0.33 iters/s

running (0m17.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
authenticated-read   [  26% ] 1/2 VUs  0m15.8s/1m0s  0.33 iters/s

running (0m18.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
authenticated-read   [  28% ] 1/2 VUs  0m16.8s/1m0s  0.33 iters/s

running (0m19.0s), 0/2 VUs, 6 complete and 0 interrupted iterations
authenticated-read   [  30% ] 0/2 VUs  0m17.8s/1m0s  0.33 iters/s

running (0m20.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
authenticated-read   [  31% ] 1/2 VUs  0m18.8s/1m0s  0.33 iters/s

running (0m21.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
authenticated-read   [  33% ] 1/2 VUs  0m19.8s/1m0s  0.33 iters/s

running (0m22.0s), 0/2 VUs, 7 complete and 0 interrupted iterations
authenticated-read   [  35% ] 0/2 VUs  0m20.8s/1m0s  0.33 iters/s

running (0m23.0s), 1/2 VUs, 7 complete and 0 interrupted iterations
authenticated-read   [  36% ] 1/2 VUs  0m21.8s/1m0s  0.33 iters/s

running (0m24.0s), 1/2 VUs, 7 complete and 0 interrupted iterations
authenticated-read   [  38% ] 1/2 VUs  0m22.8s/1m0s  0.33 iters/s

running (0m25.0s), 0/2 VUs, 8 complete and 0 interrupted iterations
authenticated-read   [  40% ] 0/2 VUs  0m23.8s/1m0s  0.33 iters/s

running (0m26.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
authenticated-read   [  41% ] 1/2 VUs  0m24.8s/1m0s  0.33 iters/s

running (0m27.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
authenticated-read   [  43% ] 1/2 VUs  0m25.8s/1m0s  0.33 iters/s

running (0m28.0s), 0/2 VUs, 9 complete and 0 interrupted iterations
authenticated-read   [  45% ] 0/2 VUs  0m26.8s/1m0s  0.33 iters/s

running (0m29.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
authenticated-read   [  46% ] 1/2 VUs  0m27.8s/1m0s  0.33 iters/s

running (0m30.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
authenticated-read   [  48% ] 1/2 VUs  0m28.8s/1m0s  0.33 iters/s

running (0m31.0s), 0/2 VUs, 10 complete and 0 interrupted iterations
authenticated-read   [  50% ] 0/2 VUs  0m29.8s/1m0s  0.33 iters/s

running (0m32.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
authenticated-read   [  51% ] 1/2 VUs  0m30.8s/1m0s  0.33 iters/s

running (0m33.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
authenticated-read   [  53% ] 1/2 VUs  0m31.8s/1m0s  0.33 iters/s

running (0m34.0s), 0/2 VUs, 11 complete and 0 interrupted iterations
authenticated-read   [  55% ] 0/2 VUs  0m32.8s/1m0s  0.33 iters/s

running (0m35.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
authenticated-read   [  56% ] 1/2 VUs  0m33.8s/1m0s  0.33 iters/s

running (0m36.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
authenticated-read   [  58% ] 1/2 VUs  0m34.8s/1m0s  0.33 iters/s

running (0m37.0s), 0/2 VUs, 12 complete and 0 interrupted iterations
authenticated-read   [  60% ] 0/2 VUs  0m35.8s/1m0s  0.33 iters/s

running (0m38.0s), 1/2 VUs, 12 complete and 0 interrupted iterations
authenticated-read   [  61% ] 1/2 VUs  0m36.8s/1m0s  0.33 iters/s

running (0m39.0s), 1/2 VUs, 12 complete and 0 interrupted iterations
authenticated-read   [  63% ] 1/2 VUs  0m37.8s/1m0s  0.33 iters/s

running (0m40.0s), 0/2 VUs, 13 complete and 0 interrupted iterations
authenticated-read   [  65% ] 0/2 VUs  0m38.8s/1m0s  0.33 iters/s

running (0m41.0s), 1/2 VUs, 13 complete and 0 interrupted iterations
authenticated-read   [  66% ] 1/2 VUs  0m39.8s/1m0s  0.33 iters/s

running (0m42.0s), 1/2 VUs, 13 complete and 0 interrupted iterations
authenticated-read   [  68% ] 1/2 VUs  0m40.8s/1m0s  0.33 iters/s

running (0m43.0s), 1/2 VUs, 13 complete and 0 interrupted iterations
authenticated-read   [  70% ] 1/2 VUs  0m41.8s/1m0s  0.33 iters/s

running (0m44.0s), 1/2 VUs, 14 complete and 0 interrupted iterations
authenticated-read   [  71% ] 1/2 VUs  0m42.8s/1m0s  0.33 iters/s

running (0m45.0s), 1/2 VUs, 14 complete and 0 interrupted iterations
authenticated-read   [  73% ] 1/2 VUs  0m43.8s/1m0s  0.33 iters/s

running (0m46.0s), 0/2 VUs, 15 complete and 0 interrupted iterations
authenticated-read   [  75% ] 0/2 VUs  0m44.8s/1m0s  0.33 iters/s

running (0m47.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
authenticated-read   [  76% ] 1/2 VUs  0m45.8s/1m0s  0.33 iters/s

running (0m48.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
authenticated-read   [  78% ] 1/2 VUs  0m46.8s/1m0s  0.33 iters/s

running (0m49.0s), 0/2 VUs, 16 complete and 0 interrupted iterations
authenticated-read   [  80% ] 0/2 VUs  0m47.8s/1m0s  0.33 iters/s

running (0m50.0s), 1/2 VUs, 16 complete and 0 interrupted iterations
authenticated-read   [  81% ] 1/2 VUs  0m48.8s/1m0s  0.33 iters/s

running (0m51.0s), 1/2 VUs, 16 complete and 0 interrupted iterations
authenticated-read   [  83% ] 1/2 VUs  0m49.8s/1m0s  0.33 iters/s

running (0m52.0s), 0/2 VUs, 17 complete and 0 interrupted iterations
authenticated-read   [  85% ] 0/2 VUs  0m50.8s/1m0s  0.33 iters/s

running (0m53.0s), 1/2 VUs, 17 complete and 0 interrupted iterations
authenticated-read   [  86% ] 1/2 VUs  0m51.8s/1m0s  0.33 iters/s

running (0m54.0s), 1/2 VUs, 17 complete and 0 interrupted iterations
authenticated-read   [  88% ] 1/2 VUs  0m52.8s/1m0s  0.33 iters/s

running (0m55.0s), 0/2 VUs, 18 complete and 0 interrupted iterations
authenticated-read   [  90% ] 0/2 VUs  0m53.8s/1m0s  0.33 iters/s

running (0m56.0s), 1/2 VUs, 18 complete and 0 interrupted iterations
authenticated-read   [  91% ] 1/2 VUs  0m54.8s/1m0s  0.33 iters/s

running (0m57.0s), 1/2 VUs, 18 complete and 0 interrupted iterations
authenticated-read   [  93% ] 1/2 VUs  0m55.8s/1m0s  0.33 iters/s

running (0m58.0s), 0/2 VUs, 19 complete and 0 interrupted iterations
authenticated-read   [  95% ] 0/2 VUs  0m56.8s/1m0s  0.33 iters/s

running (0m59.0s), 1/2 VUs, 19 complete and 0 interrupted iterations
authenticated-read   [  96% ] 1/2 VUs  0m57.8s/1m0s  0.33 iters/s

running (1m00.0s), 1/2 VUs, 19 complete and 0 interrupted iterations
authenticated-read   [  98% ] 1/2 VUs  0m58.8s/1m0s  0.33 iters/s

running (1m01.0s), 0/2 VUs, 20 complete and 0 interrupted iterations
authenticated-read   [ 100% ] 0/2 VUs  0m59.8s/1m0s  0.33 iters/s

running (1m02.0s), 1/2 VUs, 20 complete and 0 interrupted iterations
authenticated-read ↓ [ 100% ] 0/2 VUs  1m0s  0.33 iters/s

running (1m03.0s), 1/2 VUs, 20 complete and 0 interrupted iterations
authenticated-read ↓ [ 100% ] 0/2 VUs  1m0s  0.33 iters/s


  █ THRESHOLDS 

    timeout_count
    ✓ 'count==0' count=0

    unexpected_5xx_count
    ✓ 'count==0' count=0

    unexpected_error_rate
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 128    2.004797/s
    checks_succeeded...: 83.59% 107 out of 128
    checks_failed......: 16.40% 21 out of 128


    CUSTOM
    http_status_count..................: 64     1.002399/s
    latency_games_me...................: avg=934.35ms min=852.54ms p(50)=891.31ms p(95)=1.2s     p(99)=1.21s max=1.22s
    latency_login......................: avg=1.13s    min=1.13s    p(50)=1.13s    p(95)=1.13s    p(99)=1.13s max=1.13s
    latency_notification_preferences...: avg=784.11ms min=701.28ms p(50)=751.08ms p(95)=1.07s    p(99)=1.07s max=1.07s
    latency_notifications_unread.......: avg=736.41ms min=676.17ms p(50)=706.64ms p(95)=810.54ms p(99)=1.05s max=1.11s
    timeout_count......................: 0      0/s
    unexpected_5xx_count...............: 0      0/s
    unexpected_error_rate..............: 0.00%  0 out of 64

    HTTP
    http_req_duration..................: avg=823.17ms min=676.17ms p(50)=785.12ms p(95)=1.12s    p(99)=1.2s  max=1.22s
      { expected_response:true }.......: avg=823.17ms min=676.17ms p(50)=785.12ms p(95)=1.12s    p(99)=1.2s  max=1.22s
    http_req_failed....................: 0.00%  0 out of 64
    http_reqs..........................: 64     1.002399/s

    EXECUTION
    iteration_duration.................: avg=2.45s    min=2.26s    p(50)=2.39s    p(95)=2.77s    p(99)=2.93s max=2.97s
    iterations.........................: 21     0.328912/s
    vus................................: 1      min=0       max=1
    vus_max............................: 2      min=2       max=2

    NETWORK
    data_received......................: 23 kB  357 B/s
    data_sent..........................: 8.6 kB 135 B/s



running (1m03.8s), 0/2 VUs, 21 complete and 0 interrupted iterations
authenticated-read ✓ [ 100% ] 0/2 VUs  1m0s  0.33 iters/s